Table of Contents
 Class IdeaStatiCaAppClient
Namespace
IdeaStatiCa.Plugin
Assembly
IdeaStatiCa.Plugin.dll
public class IdeaStatiCaAppClient : ClientBase<IIdeaStaticaApp>, ICommunicationObject, IDisposable, IIdeaStaticaApp, IProgressMessaging
Inheritance
object
ClientBase<IIdeaStaticaApp>
IdeaStatiCaAppClient
Implements
ICommunicationObject
IDisposable
IIdeaStaticaApp
IProgressMessaging
Inherited Members
 ClientBase<IIdeaStaticaApp>.GetDefaultValueForInitialization<T>()
 ClientBase<IIdeaStaticaApp>.Open()
 ClientBase<IIdeaStaticaApp>.Abort()
 ClientBase<IIdeaStaticaApp>.Close()
 ClientBase<IIdeaStaticaApp>.DisplayInitializationUI()
 ClientBase<IIdeaStaticaApp>.CreateChannel()
 ClientBase<IIdeaStaticaApp>.InvokeAsync(ClientBase<IIdeaStaticaApp>.BeginOperationDelegate, object[], ClientBase<IIdeaStaticaApp>.EndOperationDelegate, SendOrPostCallback, object)
 ClientBase<IIdeaStaticaApp>.Channel
 ClientBase<IIdeaStaticaApp>.CacheSetting
 ClientBase<IIdeaStaticaApp>.ChannelFactory
 ClientBase<IIdeaStaticaApp>.ClientCredentials
 ClientBase<IIdeaStaticaApp>.State
 ClientBase<IIdeaStaticaApp>.InnerChannel
 ClientBase<IIdeaStaticaApp>.Endpoint
 object.ToString()
 object.Equals(object)
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaStatiCaAppClient(string)
public IdeaStatiCaAppClient(string id)
Parameters
id string
Properties
 Service
protected IIdeaStaticaApp Service { get; }
Property Value
IIdeaStaticaApp
Methods
 CancelMessage()
public void CancelMessage()
 GetAllConnectionData(int)
Get structural data and corresponding results of FE analysis for connectionId
public string GetAllConnectionData(int connectionId)
Parameters
connectionId int
Identifier of the required connection
Returns
string
XML string which prepresents the instance of of IdeaRS.OpenModel.OpenModelContainer (stuctural data and results of FE analysis)
Exceptions
Exception
Exception is thrown if operation fails or no data are provided by the service
 GetCancellationFlag()
public bool GetCancellationFlag()
Returns
bool
 GetConnectionModel(int)
Get connection model in IOM format
public ConnectionData GetConnectionModel(int connectionId)
Parameters
connectionId int
The ID of the connection in the project
Returns
ConnectionData
Connection model
Exceptions
Exception
Exception is thrown if operation fails or no data are provided by the service
 GetCssInMPRL(CountryCode)
Get all cross-sections from IDEA StatiCa MPRL (material and product range library) which belongs to countryCode
public List<LibraryItem> GetCssInMPRL(CountryCode countryCode)
Parameters
countryCode CountryCode
Country code filter
Returns
List<LibraryItem>
Cross-sections in the MPRL
 GetCssInProject()
Get all cross-sections in the currently open project
public List<ProjectItem> GetCssInProject()
Returns
List<ProjectItem>
Cross-sections in the project
 GetCssInProjectV2()
Get all cross-sections in the currently open project
public List<CrossSectionProjectItem> GetCssInProjectV2()
Returns
List<CrossSectionProjectItem>
Cross-sections with assigned material in the project
 GetCurrentCulture()
public CultureInfo GetCurrentCulture()
Returns
CultureInfo
 GetLocalizedText(LocalisedMessage)
public string GetLocalizedText(LocalisedMessage msg)
Parameters
msg LocalisedMessage
Returns
string
 GetMaterialsInMPRL(CountryCode)
Get all materials from IDEA StatiCa MPRL (material and product range library) which belongs to countryCode
public List<LibraryItem> GetMaterialsInMPRL(CountryCode countryCode)
Parameters
countryCode CountryCode
Country code filter
Returns
List<LibraryItem>
Materials in the MPRL
 GetMaterialsInProject()
Get all materials in the currently open project
public List<ProjectItem> GetMaterialsInProject()
Returns
List<ProjectItem>
Materials in the project
 InitProgressDialog()
public void InitProgressDialog()
 SendMessage(MessageSeverity, LocalisedMessage)
public void SendMessage(MessageSeverity severity, LocalisedMessage msg)
Parameters
severity MessageSeverity
msg LocalisedMessage
 SendMessage(MessageSeverity, string)
public void SendMessage(MessageSeverity severity, string text)
Parameters
severity MessageSeverity
text string
 SendMessageInteractive(MessageSeverity, string, string[])
public int SendMessageInteractive(MessageSeverity severity, string text, string[] buttons)
Parameters
severity MessageSeverity
text string
buttons string[]
Returns
int
 SendMessageLocalised(MessageSeverity, LocalisedMessage, string)
public void SendMessageLocalised(MessageSeverity severity, LocalisedMessage msg, string suffix = "")
Parameters
severity MessageSeverity
msg LocalisedMessage
suffix string
 SetStage(int, int, LocalisedMessage)
public void SetStage(int stage, int stageMax, LocalisedMessage msg)
Parameters
stage int
stageMax int
msg LocalisedMessage
 SetStage(int, int, string)
public void SetStage(int stage, int stageMax, string name)
Parameters
stage int
stageMax int
name string
 SetStageLocalised(int, int, LocalisedMessage, params object[])
public void SetStageLocalised(int stage, int stageMax, LocalisedMessage msg, params object[] args)
Parameters
stage int
stageMax int
msg LocalisedMessage
args object[]
 SetStageProgress(double)
public void SetStageProgress(double percentage)
Parameters
percentage double
 Edit this page